{
    "Advanced Options": "Opciones avanzadas",
    "Device IP Address": "Dirección IP del dispositivo",
    "Device Port": "Puerto del dispositivo",
    "Factor to calculate German water hardnes from conductivity.": "Factor para calcular la dureza del agua alemana a partir de la conductividad.",
    "IP address of first SYR SaveFloor Connect device": "Dirección IP del primer dispositivo SYR SaveFloor Connect",
    "IP address of fourth SYR SaveFloor Connect device": "Dirección IP del cuarto dispositivo SYR SaveFloor Connect",
    "IP address of second SYR SaveFloor Connect device": "Dirección IP del segundo dispositivo SYR SaveFloor Connect",
    "IP address of third SYR SaveFloor Connect device": "Dirección IP del tercer dispositivo SYR SaveFloor Connect",
    "IP or hostname of your SYR SaveTech Connect 2422 or your POLYGONVATRO leakage protection device.": "IP o nombre de host de su SYR SaveTech Connect 2422 o su dispositivo de protección contra fugas POLYGONVATRO.",
    "Options": "Opciones",
    "Port of your SYR SaveTech Connect 2422 or your POLYGONVATRO leakage protection device": "Puerto de su SYR SaveTech Connect 2422 o su dispositivo de protección contra fugas POLYGONVATRO",
    "SafeFloor Connect 1 - IP address": "SafeFloor Connect 1 - Dirección IP",
    "SafeFloor Connect 1 - Serial number": "SafeFloor Connect 1 - Número de serie",
    "SafeFloor Connect 2 - IP address": "SafeFloor Connect 2 - Dirección IP",
    "SafeFloor Connect 2 - Serial number": "SafeFloor Connect 2 - Número de serie",
    "SafeFloor Connect 3 - IP address": "SafeFloor Connect 3 - Dirección IP",
    "SafeFloor Connect 3 - Serial number": "SafeFloor Connect 3 - Número de serie",
    "SafeFloor Connect 4 - IP address": "SafeFloor Connect 4 - Dirección IP",
    "SafeFloor Connect 4 - Serial number": "SafeFloor Connect 4 - Número de serie",
    "SafeFloor Units": "Unidades Safe Floor",
    "Seconds to retry connection to device": "Segundos para reintentar la conexión al dispositivo",
    "Serial number of first SYR SaveFloor Connect device": "Número de serie del primer dispositivo SYR SaveFloor Connect",
    "Serial number of fourth SYR SaveFloor Connect device": "Número de serie del cuarto dispositivo SYR SaveFloor Connect",
    "Serial number of second SYR SaveFloor Connect device": "Número de serie del segundo dispositivo SYR SaveFloor Connect",
    "Serial number of third SYR SaveFloor Connect device": "Número de serie del tercer dispositivo SYR SaveFloor Connect",
    "Tasks": "Tareas",
    "Timeout device data request in seconds": "Solicitud de datos del dispositivo de tiempo de espera en segundos",
    "alarm polling time in seconds": "tiempo de sondeo de alarma en segundos",
    "factor german water hardness": "factor alemán dureza del agua",
    "fast polling time in seconds": "tiempo de sondeo rápido en segundos",
    "more logging messages": "más mensajes de registro",
    "more loging messages": "más mensajes de registro",
    "regular main valve movement": "movimiento regular de la válvula principal",
    "show API response as info logging messages": "mostrar la respuesta de la API como mensajes de registro de información",
    "show api response as info logging messages": "mostrar respuesta api como información mensajes de registro",
    "show values as log info messages": "mostrar valores como mensajes de información de registro",
    "slow polling time in seconds": "tiempo de sondeo lento en segundos",
    "timing of regular main valve movement": "sincronización del movimiento regular de la válvula principal",
    "very slow polling time in seconds": "tiempo de sondeo muy lento en segundos",
    "wamo adapter settings": "Ajustes del adaptador para wamo"
}
