{
    "common": {
        "name": "wamo",
        "version": "0.2.9",
        "news": {
            "0.2.9": {
                "en": "states changable ATP, BTB, BSA, BUZ, DMA, DRP, IDS, LNG, LWT\nstate types changed ATP, BSA, BUZ, DMA, DRP, DWL, IDS, LNG, LWT\nadded states TMZ, TN, 71, ALD, CLP, BPB\nadded channel and states for self learning: SLP, SLO, SOF, SMF, SLE, SLV, SLT, SLF\nchange splitted options into two tabs \nadded options to define timeout for axios request \nadded options for delay time between reconection try to device if connection got lost\nchange - exported Parameter declarations and parameter collections for timer into a seperate file 'lib/device-parameters.js'",
                "de": "changable ATP, BTB, BSA, BUZ, DMA, DRP, IDS, LNG, LWT\nzustandstypen geändert ATP, BSA, BUZ, DMA, DRP, DWL, IDS, LNG, LWT\ntMZ, TN, 71, ALD, CLP, BPB\nzusätzlich Kanal und Zustände für Selbstlernen: SLP, SLO, SOF, SMF, SLE, SLV, SLT, SLF\ngespaltene optionen in zwei tabs ändern\nzusätzliche optionen, um timeout für axios anfrage zu definieren\nzusätzliche optionen für verzögerung zeit zwischen rekonstruktion versuchen, gerät, wenn verbindung verloren\nändern - exportiert Parameter-Deklarationen und Parameter-Sammlungen für Timer in eine seperate Datei lib/device-Parameter. j)",
                "ru": "государства changable ATP, BTB, BSA, BUZ, DMA, DRP, IDS, LNG, LWT\nтипы штатов изменены ATP, BSA, BUZ, DMA, DRP, DWL, IDS, LNG, LWT\nдобавлены состояния TMZ, TN, 71, ALD, CLP, BPB\nдобавлены каналы и состояния для самостоятельного обучения: SLP, SLO, SOF, SMF, SLE, SLV, SLT, SLF\nизменить разделенные опции на две вкладки\nдобавлены опции для определения timeout для запроса axios\nдобавлены опции для задержки между reconection попробуйте устройство, если соединение потеряно\nизменить - экспортируемые параметры декларации и коллекции параметров для таймера в сеператый файл lib/device-parameters. Джс",
                "pt": "estados ATP changable, BTB, BSA, BUZ, DMA, DRP, IDS, LNG, LWT\ntipos de estado mudou ATP, BSA, BUZ, DMA, DRP, DWL, IDS, LNG, LWT\nestados adicionados TMZ, TN, 71, ALD, CLP, BPB\ncanal adicionado e estados para auto-aprendizagem: SLP, SLO, SOF, SMF, SLE, SLV, SLT, SLF\nalterar opções divididas em duas abas\nopções adicionadas para definir timeout para solicitação de axios\nopções adicionais para o tempo de atraso entre a reconecção tentar dispositivo se a conexão se perdeu\nchange - exportado Declarações de parâmetros e coleções de parâmetros para timer em um arquivo seperate lib/device-parameters. Js",
                "nl": "aTP, BTB, BSA, BUZ, DRP, IDS, LNG, LWTB, BTB, BSA, BUZ, BUZ, DMA, DMA, DRP, DRP, DRP, DRP, IDS, LNG\nde staatstypes veranderden ATP, BSA, BUZ, DRP, DWL, IDS, LWT\ntMZ, TN, 71, ALD, CLP, BPB\nvertaling:\nverdeelde opties in twee tabs\nvoegde opties om de time-out te definiëren voor axios verzoek\nvoegde opties toe voor vertragingstijd tussen verzoening, als de verbinding verbroken werd\nverandering - exporteerde Parameter verklaringen en parameter collecties voor timer in een seperaat bestand lib/device-parameters. Js",
                "fr": "aTP, BTB, BSA, BUZ, DMA, DRP, IDS, LNG, LWT\naTP, BSA, BUZ, DMA, DRP, DWL, IDS, LNG, LWT\nétats ajoutés TMZ, TN, 71, ALD, CLP, BPB\ncanal ajouté et états pour l'autoapprentissage: SLP, SLO, SOF, SMF, SLE, SLV, SLT, SLF\nchanger les options divisées en deux onglets\noptions supplémentaires pour définir le timeout pour la demande axios\noptions supplémentaires pour le délai entre la reconection essayer de périphérique si la connexion se perd\nchange - les déclarations de paramètres exportées et les collections de paramètre pour timer dans un fichier seperate lib/device-parameters. js",
                "it": "stati ATP, BTB, BSA, BUZ, DMA, DRP, IDS, LNG, LWT\ntipi di stato cambiato ATP, BSA, BUZ, DMA, DRP, DWL, IDS, LNG, LWT\nstati aggiunti TMZ, TN, 71, ALD, CLP, BPB\ncanale aggiunto e stati per l'autoapprendimento: SLP, SLO, SOF, SMF, SLE, SLV, SLT, SLF\ncambiare le opzioni divise in due schede\nopzioni aggiuntive per definire timeout per richiesta assios\nopzioni aggiuntive per il tempo di ritardo tra la correzione cercare di dispositivo se la connessione è andata persa\ncambiamento - esportato le dichiarazioni dei parametri e le collezioni dei parametri per il timer in un seperate file lib/device-parametri. j",
                "es": "aTP, BTB, BSA, BUZ, DMA, DRP, IDS, LNG, LWT\ntipos de estado cambiaron ATP, BSA, BUZ, DMA, DRP, DWL, IDS, LNG, LWT\nestados añadidos TMZ, TN, 71, ALD, CLP, BPB\ncanal añadido y estados para el auto aprendizaje: SLP, SLO, SOF, SMF, SLE, SLV, SLT, SLF\ncambiar opciones divididas en dos pestañas\nopciones adicionales para definir el tiempo de espera para la solicitud de axios\nopciones adicionales para el tiempo de demora entre la reconección tratar de dispositivo si la conexión se perdió\ncambio - exportado Declaraciones de parámetros y colecciones de parámetro para timer en un archivo seperate lib/device-parameters. js",
                "pl": "bTB, BSA, BUZ, DMA, DRP, IDS, LWT, LWT\nzmieniły one ATP, BSA, BUZ, DMA, DRP, DWL, IDS, LWT\ndodano stany TMZ, TN, 71, ALD, CLP, BPB\ndodano kanały i stany do uczenia się siebie: SLP, SLO, SOF, SMF, SLE, SLV, SLT, SLF\nzmienić opcje na dwie tabele\ndodano możliwość zdefiniowania czasu na prośbę axiosa\ndodała opcje opóźnienia pomiędzy pogodzeniem a urządzeniem, jeśli połączenia się straciły\nzmiana – wyeksportowana deklaracja Parameter i kolekcja parametrów dla czasownika w plik lib/device. js",
                "zh-cn": "aTP, BTB, BSA, BUZ, DMA, DRP, IDS, LNG, LWT\naTP, BSA, BUZ, DMA, DRP, DWL, IDS,LNG, LWT\n加入国:TMZ,TN,71, ALD, CLP,BPB\n学习的更多渠道和国家:SLP、SLO、SOF、MF、SLE、SLV、SLT、SLF\n改为两个表格的改变\n界定焦虑要求时间的更多选择\n如果连线失去,则重新部署到装置之间的拖延时间的更多选择\n变化——出口的参数声明和准时收藏的参数 j"
            },
            "0.2.8": {
                "en": "release cosmetics",
                "de": "freisetzen kosmetisches",
                "ru": "выпустить косметику",
                "pt": "liberar cosméticos",
                "nl": "vertaling:",
                "fr": "libérer les cosmétiques",
                "it": "rilascio cosmetici",
                "es": "liberación cosmética",
                "pl": "uwalnianie kosmetyków",
                "zh-cn": "释放联合材料"
            },
            "0.2.7": {
                "en": "added 2 additional options to define lof.info messages\nchange using single api client to communicate with the device\nsome code optimizations and cleanups",
                "de": "zusätzlich 2 optionen zur definition von lof.info-nachrichten\nmit einem einzigen api-client ändern, um mit dem gerät zu kommunizieren\neinige codeoptimierungen und -reinigungen",
                "ru": "добавлено 2 дополнительных опции для определения сообщений lof.info\nизменить с помощью одного api клиента, чтобы общаться с устройством\nнекоторые оптимизации кода и очистки",
                "pt": "adicionado 2 opções adicionais para definir mensagens lof.info\nmudar usando um único cliente api para se comunicar com o dispositivo\nalgumas otimizações de código e limpezas",
                "nl": "voegde twee extra opties toe om lof info berichten te definiëren\nverandering met één api cliënt om te communiceren met het apparaat\nwat code optimaties en opruiming",
                "fr": "2 options supplémentaires pour définir des messages lof.info\nchanger en utilisant un seul client api pour communiquer avec l'appareil\nquelques optimisations de code et nettoyages",
                "it": "aggiunto 2 opzioni aggiuntive per definire i messaggi lof.info\ncambiare utilizzando un singolo client api per comunicare con il dispositivo\nalcune ottimizzazioni di codice e pulizia",
                "es": "añadido 2 opciones adicionales para definir mensajes de lof.info\ncambiar usando un solo cliente api para comunicarse con el dispositivo\nalgunas optimizaciones de código y limpiezas",
                "pl": "dodano dwie dodatkowe opcje definiowania wiadomości\nzmiana pojedynczego klienta by komunikować się z urządzeniem\nniektóre z optymalizacji kodu i czyszczeń",
                "zh-cn": "增加另外两个选择,以界定定位信息。\n使用单一皮埃尔客户与装置联系的改变\n某些守则的优化和清洁"
            },
            "0.2.6": {
                "en": "added 2 additional options to define lof.info messages\nchange using single api client to communicate with the device\nsome code optimizations and cleanups",
                "de": "zusätzlich 2 optionen zur definition von lof.info-nachrichten\nmit einem einzigen api-client ändern, um mit dem gerät zu kommunizieren\neinige codeoptimierungen und -reinigungen",
                "ru": "добавлено 2 дополнительных опции для определения сообщений lof.info\nизменить с помощью одного api клиента, чтобы общаться с устройством\nнекоторые оптимизации кода и очистки",
                "pt": "adicionado 2 opções adicionais para definir mensagens lof.info\nmudar usando um único cliente api para se comunicar com o dispositivo\nalgumas otimizações de código e limpezas",
                "nl": "voegde twee extra opties toe om lof info berichten te definiëren\nverandering met één api cliënt om te communiceren met het apparaat\nwat code optimaties en opruiming",
                "fr": "2 options supplémentaires pour définir des messages lof.info\nchanger en utilisant un seul client api pour communiquer avec l'appareil\nquelques optimisations de code et nettoyages",
                "it": "aggiunto 2 opzioni aggiuntive per definire i messaggi lof.info\ncambiare utilizzando un singolo client api per comunicare con il dispositivo\nalcune ottimizzazioni di codice e pulizia",
                "es": "añadido 2 opciones adicionales para definir mensajes de lof.info\ncambiar usando un solo cliente api para comunicarse con el dispositivo\nalgunas optimizaciones de código y limpiezas",
                "pl": "dodano dwie dodatkowe opcje definiowania wiadomości\nzmiana pojedynczego klienta by komunikować się z urządzeniem\nniektóre z optymalizacji kodu i czyszczeń",
                "zh-cn": "增加另外两个选择,以界定定位信息。\n使用单一皮埃尔客户与装置联系的改变\n某些守则的优化和清洁"
            },
            "0.2.5": {
                "en": "Readme file clean up",
                "de": "Readme Datei aufräumen",
                "ru": "Readme файл очистить вверх",
                "pt": "Leia o arquivo clean-up",
                "nl": "Vertaling:",
                "fr": "Le fichier Readme nettoie",
                "it": "Readme file pulizia",
                "es": "Archivo de Readme limpia",
                "pl": "Czyste pliki",
                "zh-cn": "阅读档案清洁"
            },
            "0.2.4": {
                "en": "Readme file clean up",
                "de": "Readme Datei aufräumen",
                "ru": "Readme файл очистить вверх",
                "pt": "Leia o arquivo clean-up",
                "nl": "Vertaling:",
                "fr": "Le fichier Readme nettoie",
                "it": "Readme file pulizia",
                "es": "Archivo de Readme limpia",
                "pl": "Czyste pliki",
                "zh-cn": "阅读档案清洁"
            },
            "0.2.3": {
                "en": "Admin 5 support, TMP changable, connection status",
                "de": "Admin 5 Unterstützung, TMP changbar, Verbindungsstatus",
                "ru": "Admin 5 поддержка, TMP changable, статус соединения",
                "pt": "Admin 5 suporte, TMP changable, status de conexão",
                "nl": "Admin 5 steun, TMP changable, connectie status",
                "fr": "Admin 5 support, TMP changable, état de connexion",
                "it": "Admin 5 supporto, TMP pugilato, stato di connessione",
                "es": "Soporte de Admin 5, changable TMP, estado de conexión",
                "pl": "Admin 5 obsługuje TMP changable, status połączenia",
                "zh-cn": "突出5种支持,TMPuggangable,联系地位"
            },
            "0.2.0": {
                "en": "All parameters in the profile section can now be changed and the active Profile “PRF” is now also changeable, so you can select the active profile.",
                "de": "Alle Parameter im Profilabschnitt können nun geändert werden und das aktive Profil „PRF“ ist nun auch änderbar, so dass Sie das aktive Profil auswählen können.",
                "ru": "Все параметры в разделе профиля теперь могут быть изменены и активный профиль “PRF” теперь также меняется, так что вы можете выбрать активный профиль.",
                "pt": "Todos os parâmetros na seção de perfil agora podem ser alterados e o perfil ativo “PRF” agora também é mutável, para que você possa selecionar o perfil ativo.",
                "nl": "Alle parameters in het profiel kunnen nu veranderen en de actieve Profile is nu ook veranderd, dus je kunt het actieve profiel kiezen.",
                "fr": "Tous les paramètres de la section de profil peuvent maintenant être changés et le Profil actif “PRF” est maintenant également modifiable, de sorte que vous pouvez sélectionner le profil actif.",
                "it": "Tutti i parametri nella sezione del profilo possono ora essere modificati e il profilo attivo “PRF” è ora anche modificabile, in modo da poter selezionare il profilo attivo.",
                "es": "Todos los parámetros de la sección de perfil ahora se pueden cambiar y el perfil activo “PRF” es ahora también cambiante, por lo que puede seleccionar el perfil activo.",
                "pl": "Wszystkie parametry w sekcji profilu mogą być obecnie zmieniane, a aktywny profil „PRF” jest obecnie zmienny, więc można wybrać profil aktywny.",
                "zh-cn": "简介科的所有参数现在可以改变,目前积极的“PRF”是可以改变的,因此你可以选择积极的形象。."
            }
        },
        "titleLang": {
            "en": "wamo",
            "de": "wamo",
            "ru": "wamo",
            "pt": "Detecção de vazamento",
            "nl": "wamo",
            "fr": "wamo",
            "it": "PerditaDect",
            "es": "Detección de fugas",
            "pl": "wamo",
            "zh-cn": "泄漏检测"
        },
        "desc": {
            "en": "wamo",
            "de": "wamo",
            "ru": "утечка",
            "pt": "vazamento",
            "nl": "lekdetectie",
            "fr": "détection de fuite",
            "it": "leakedect",
            "es": "fugadecto",
            "pl": "wyciek wycieku",
            "zh-cn": "泄漏检测"
        },
        "authors": [
            "smarthausleben <info@smarthausleben.de>"
        ],
        "keywords": [
            "leakage protection",
            "leakage monitor"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "wamo.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/smarthausleben/ioBroker.wamo/main/admin/wamo.png",
        "readme": "https://github.com/smarthausleben/ioBroker.wamo/blob/main/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "iot-systems",
        "compact": true,
        "connectionType": "local",
        "dataSource": "poll",
        "materialize": true,
        "adminUI": {
            "config": "json"
        },
        "dependencies": [
            {
                "js-controller": ">=2.0.0"
            }
        ],
        "globalDependencies": [
            {
                "admin": ">=5.1.28"
            }
        ]
    },
    "native": {
        "device_ip": "0.0.0.0",
        "device_port": 5333,
        "factor_german_water_hardnes": 0.03030303,
        "device_alarm_poll_interval": 30,
        "device_short_poll_interval": 60,
        "device_long_poll_interval": 120,
        "device_very_long_poll_interval": 300,
        "moremessages": false,
        "apiresponsemessages": false,
        "valueinfomessages": true,
        "reconnectingdelaytime": 5,
        "requesttimeout": 5
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": {
                    "en": "Information",
                    "de": "Information",
                    "ru": "Информация",
                    "pt": "Em formação",
                    "nl": "Informatie",
                    "fr": "Information",
                    "it": "Informazione",
                    "es": "Información",
                    "pl": "Informacja",
                    "zh-cn": "信息"
                }
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If communication with circuit works",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}