{
    "Advanced Options": "Opções avançadas",
    "Device IP Address": "Endereço IP do dispositivo",
    "Device Port": "Porta do dispositivo",
    "Factor to calculate German water hardnes from conductivity.": "Fator para calcular a dureza da água alemã a partir da condutividade.",
    "IP address of first SYR SaveFloor Connect device": "Endereço IP do primeiro dispositivo SYR SaveFloor Connect",
    "IP address of fourth SYR SaveFloor Connect device": "Endereço IP do quarto dispositivo SYR SaveFloor Connect",
    "IP address of second SYR SaveFloor Connect device": "Endereço IP do segundo dispositivo SYR SaveFloor Connect",
    "IP address of third SYR SaveFloor Connect device": "Endereço IP do terceiro dispositivo SYR SaveFloor Connect",
    "IP or hostname of your SYR SaveTech Connect 2422 or your POLYGONVATRO leakage protection device.": "IP ou nome de host do seu SYR SaveTech Connect 2422 ou do seu dispositivo de proteção contra vazamento POLYGONVATRO.",
    "Options": "Opções",
    "Port of your SYR SaveTech Connect 2422 or your POLYGONVATRO leakage protection device": "Porta do seu SYR SaveTech Connect 2422 ou do seu dispositivo de proteção contra vazamento POLYGONVATRO",
    "SafeFloor Connect 1 - IP address": "SafeFloor Connect 1 - endereço IP",
    "SafeFloor Connect 1 - Serial number": "SafeFloor Connect 1 - Número de série",
    "SafeFloor Connect 2 - IP address": "SafeFloor Connect 2 - endereço IP",
    "SafeFloor Connect 2 - Serial number": "SafeFloor Connect 2 - Número de série",
    "SafeFloor Connect 3 - IP address": "SafeFloor Connect 3 - endereço IP",
    "SafeFloor Connect 3 - Serial number": "SafeFloor Connect 3 - Número de série",
    "SafeFloor Connect 4 - IP address": "SafeFloor Connect 4 - endereço IP",
    "SafeFloor Connect 4 - Serial number": "SafeFloor Connect 4 - Número de série",
    "SafeFloor Units": "Unidades SafeFloor",
    "Seconds to retry connection to device": "Segundos para tentar novamente a conexão com o dispositivo",
    "Serial number of first SYR SaveFloor Connect device": "Número de série do primeiro dispositivo SYR SaveFloor Connect",
    "Serial number of fourth SYR SaveFloor Connect device": "Número de série do quarto dispositivo SYR SaveFloor Connect",
    "Serial number of second SYR SaveFloor Connect device": "Número de série do segundo dispositivo SYR SaveFloor Connect",
    "Serial number of third SYR SaveFloor Connect device": "Número de série do terceiro dispositivo SYR SaveFloor Connect",
    "Tasks": "Tarefas",
    "Timeout device data request in seconds": "Tempo limite da solicitação de dados do dispositivo em segundos",
    "alarm polling time in seconds": "tempo de sondagem de alarme em segundos",
    "factor german water hardness": "fator dureza da água alemã",
    "fast polling time in seconds": "tempo de sondagem rápido em segundos",
    "more logging messages": "mais mensagens de registro",
    "more loging messages": "mais mensagens de registro",
    "regular main valve movement": "movimento regular da válvula principal",
    "show API response as info logging messages": "mostre a resposta da API como mensagens de registro de informações",
    "show api response as info logging messages": "mostrar api resposta como info mensagens de registro",
    "show values as log info messages": "mostrar valores como mensagens de informações de log",
    "slow polling time in seconds": "tempo de sondagem lento em segundos",
    "timing of regular main valve movement": "temporização do movimento regular da válvula principal",
    "very slow polling time in seconds": "tempo de sondagem muito lento em segundos",
    "wamo adapter settings": "Configurações do adaptador para wamo"
}
