{
    "Advanced Options": "Opzioni avanzate",
    "Device IP Address": "Indirizzo IP del dispositivo",
    "Device Port": "Porta del dispositivo",
    "Emptys battery very fast and therefore this option only makes sense if sensor uses a power supply": "Svuota la batteria molto velocemente e quindi questa opzione ha senso solo se il sensore utilizza un alimentatore",
    "Enable executing test loop": "Abilita l'esecuzione del ciclo di test",
    "Factor to calculate German water hardnes from conductivity.": "Fattore per calcolare la durezza dell'acqua tedesca dalla conducibilità.",
    "For testing purpose only. If enabled, a cron based scheduled function [Test Loop] will be executeed.": "Solo a scopo di test. Se abilitato, verrà eseguita una funzione pianificata basata su cron [Test Loop].",
    "IP address of first SYR SaveFloor Connect device": "Indirizzo IP del primo dispositivo SYR SaveFloor Connect",
    "IP address of fourth SYR SaveFloor Connect device": "Indirizzo IP del quarto dispositivo SYR SaveFloor Connect",
    "IP address of second SYR SaveFloor Connect device": "Indirizzo IP del secondo dispositivo SYR SaveFloor Connect",
    "IP address of third SYR SaveFloor Connect device": "Indirizzo IP del terzo dispositivo SYR SaveFloor Connect",
    "IP or hostname of your SYR SaveTech Connect 2422 or your POLYGONVATRO leakage protection device.": "IP o nome host del tuo SYR SaveTech Connect 2422 o del tuo dispositivo di protezione dalle perdite POLYGONVATRO.",
    "Keep online": "Resta in linea",
    "Options": "Opzioni",
    "Port of your SYR SaveTech Connect 2422 or your POLYGONVATRO leakage protection device": "Porta del tuo SYR SaveTech Connect 2422 o del tuo dispositivo di protezione dalle perdite POLYGONVATRO",
    "SafeFloor Connect 1 - IP address": "SafeFloor Connect 1 - Indirizzo IP",
    "SafeFloor Connect 1 - Serial number": "SafeFloor Connect 1 - Numero di serie",
    "SafeFloor Connect 2 - IP address": "SafeFloor Connect 2 - Indirizzo IP",
    "SafeFloor Connect 2 - Serial number": "SafeFloor Connect 2 - Numero di serie",
    "SafeFloor Connect 3 - IP address": "SafeFloor Connect 3 - Indirizzo IP",
    "SafeFloor Connect 3 - Serial number": "SafeFloor Connect 3 - Numero di serie",
    "SafeFloor Connect 4 - IP address": "SafeFloor Connect 4 - Indirizzo IP",
    "SafeFloor Connect 4 - Serial number": "SafeFloor Connect 4 - Numero di serie",
    "SafeFloor Units": "Unità SafeFloor",
    "Seconds to retry connection to device": "Secondi per riprovare la connessione al dispositivo",
    "Serial number of first SYR SaveFloor Connect device": "Numero di serie del primo dispositivo SYR SaveFloor Connect",
    "Serial number of fourth SYR SaveFloor Connect device": "Numero di serie del quarto dispositivo SYR SaveFloor Connect",
    "Serial number of second SYR SaveFloor Connect device": "Numero di serie del secondo dispositivo SYR SaveFloor Connect",
    "Serial number of third SYR SaveFloor Connect device": "Numero di serie del terzo dispositivo SYR SaveFloor Connect",
    "Tasks": "Compiti",
    "Timeout device data request in seconds": "Timeout della richiesta dei dati del dispositivo in secondi",
    "alarm polling time in seconds": "tempo di polling dell'allarme in secondi",
    "factor german water hardness": "fattore tedesco durezza dell'acqua",
    "fast polling time in seconds": "tempo di polling veloce in secondi",
    "more logging messages": "più messaggi di registrazione",
    "more loging messages": "più messaggi di registrazione",
    "regular main valve movement": "movimento regolare della valvola principale",
    "show API response as info logging messages": "mostra la risposta API come messaggi di registrazione delle informazioni",
    "show api response as info logging messages": "mostrare api risposta come info registrazione messaggi",
    "show values as log info messages": "mostra i valori come messaggi di informazioni di registro",
    "slow polling time in seconds": "tempo di polling lento in secondi",
    "timing of regular main valve movement": "temporizzazione del regolare movimento della valvola principale",
    "very slow polling time in seconds": "tempo di polling molto lento in secondi",
    "wamo adapter settings": "Impostazioni dell'adattatore per wamo",
    "Allow SERVICE and FACTORY state changes": "Consenti modifiche di stato SERVICE e FACTORY",
    "If this option is activated, states protected by SERVICE and FACTORY level can be changed in object view.": "Se questa opzione è attivata, gli stati protetti dal livello SERVICE e FACTORY possono essere modificati nella visualizzazione dell'oggetto."
}
