{
    "Advanced Options": "Options avancées",
    "Allow SERVICE and FACTORY state changes": "Autoriser les changements d'état SERVICE et FACTORY",
    "Device IP Address": "Adresse IP de l'appareil",
    "Device Port": "Port de l'appareil",
    "Emptys battery very fast and therefore this option only makes sense if sensor uses a power supply": "Vide la batterie très rapidement et donc cette option n'a de sens que si le capteur utilise une alimentation",
    "Enable executing test loop": "Activer l'exécution de la boucle de test",
    "Factor to calculate German water hardnes from conductivity.": "Facteur pour calculer la dureté de l'eau allemande à partir de la conductivité.",
    "For testing purpose only. If enabled, a cron based scheduled function [Test Loop] will be executeed.": "À des fins de test uniquement. Si elle est activée, une fonction planifiée basée sur cron [Test Loop] sera exécutée.",
    "Hide all trigger logging messages": "Cacher tous les messages déclencheurs",
    "IP address of first SYR SaveFloor Connect device": "Adresse IP du premier appareil SYR SaveFloor Connect",
    "IP address of fourth SYR SaveFloor Connect device": "Adresse IP du quatrième appareil SYR SaveFloor Connect",
    "IP address of second SYR SaveFloor Connect device": "Adresse IP du deuxième appareil SYR SaveFloor Connect",
    "IP address of third SYR SaveFloor Connect device": "Adresse IP du troisième appareil SYR SaveFloor Connect",
    "IP or hostname of your SYR SaveTech Connect 2422 or your POLYGONVATRO leakage protection device.": "IP ou nom d'hôte de votre SYR SaveTech Connect 2422 ou de votre dispositif de protection contre les fuites POLYGONVATRO.",
    "If this option is activated, no trigger logging messages are shown:": "Si cette option est activée, aucun message de journalisation de déclenchement n'est affiché",
    "If this option is activated, states protected by SERVICE and FACTORY level can be changed in object view.": "Si cette option est activée, les états protégés par les niveaux SERVICE et USINE peuvent être modifiés dans la vue objet.",
    "Keep online": "Restez en ligne",
    "Options": "Choix",
    "Port of your SYR SaveTech Connect 2422 or your POLYGONVATRO leakage protection device": "Port de votre SYR SaveTech Connect 2422 ou de votre dispositif de protection contre les fuites POLYGONVATRO",
    "SafeFloor Connect 1 - IP address": "SafeFloor Connect 1 - Adresse IP",
    "SafeFloor Connect 1 - Serial number": "SafeFloor Connect 1 - Numéro de série",
    "SafeFloor Connect 2 - IP address": "SafeFloor Connect 2 - Adresse IP",
    "SafeFloor Connect 2 - Serial number": "SafeFloor Connect 2 - Numéro de série",
    "SafeFloor Connect 3 - IP address": "SafeFloor Connect 3 - Adresse IP",
    "SafeFloor Connect 3 - Serial number": "SafeFloor Connect 3 - Numéro de série",
    "SafeFloor Connect 4 - IP address": "SafeFloor Connect 4 - Adresse IP",
    "SafeFloor Connect 4 - Serial number": "SafeFloor Connect 4 - Numéro de série",
    "SafeFloor Units": "Unités SafeFloor",
    "Seconds to retry connection to device": "Secondes pour réessayer la connexion à l'appareil",
    "Serial number of first SYR SaveFloor Connect device": "Numéro de série du premier appareil SYR SaveFloor Connect",
    "Serial number of fourth SYR SaveFloor Connect device": "Numéro de série du quatrième appareil SYR SaveFloor Connect",
    "Serial number of second SYR SaveFloor Connect device": "Numéro de série du deuxième appareil SYR SaveFloor Connect",
    "Serial number of third SYR SaveFloor Connect device": "Numéro de série du troisième appareil SYR SaveFloor Connect",
    "Tasks": "Tâches",
    "Timeout device data request in seconds": "Expiration de la demande de données de l'appareil en secondes",
    "alarm polling time in seconds": "temps d'interrogation de l'alarme en secondes",
    "factor german water hardness": "facteur de dureté de l'eau allemande",
    "fast polling time in seconds": "temps d'interrogation rapide en secondes",
    "more logging messages": "plus de messages de journalisation",
    "regular main valve movement": "mouvement régulier de la vanne principale",
    "show API response as info logging messages": "afficher la réponse de l'api sous forme de messages de journalisation d'informations",
    "show values as log info messages": "afficher les valeurs sous forme de messages d'informations de journal",
    "slow polling time in seconds": "temps d'interrogation lent en secondes",
    "timing of regular main valve movement": "moment du mouvement régulier de la vanne principale",
    "very slow polling time in seconds": "temps d'interrogation très lent en secondes",
    "wamo adapter settings": "Paramètres d'adaptateur pour wamo"
}
