{
    "Advanced Options": "Options avancées",
    "Device IP Address": "Adresse IP de l'appareil",
    "Device Port": "Port de l'appareil",
    "Enable executing test loop": "Activer l'exécution de la boucle de test",
    "Factor to calculate German water hardnes from conductivity.": "Facteur pour calculer la dureté de l'eau allemande à partir de la conductivité.",
    "For testing purpose only. If enabled, a cron based scheduled function [Test Loop] will be executeed.": "À des fins de test uniquement. Si elle est activée, une fonction planifiée basée sur cron [Test Loop] sera exécutée.",
    "IP address of first SYR SaveFloor Connect device": "Adresse IP du premier appareil SYR SaveFloor Connect",
    "IP address of fourth SYR SaveFloor Connect device": "Adresse IP du quatrième appareil SYR SaveFloor Connect",
    "IP address of second SYR SaveFloor Connect device": "Adresse IP du deuxième appareil SYR SaveFloor Connect",
    "IP address of third SYR SaveFloor Connect device": "Adresse IP du troisième appareil SYR SaveFloor Connect",
    "IP or hostname of your SYR SaveTech Connect 2422 or your POLYGONVATRO leakage protection device.": "IP ou nom d'hôte de votre SYR SaveTech Connect 2422 ou de votre dispositif de protection contre les fuites POLYGONVATRO.",
    "Keep this floor sensor online (emptys battery very fast and therefore only makes sense if sensor uses a power supply)": "Gardez ce capteur de sol en ligne (la batterie se vide très rapidement et n'a donc de sens que si le capteur utilise une alimentation électrique)",
    "Options": "Choix",
    "Port of your SYR SaveTech Connect 2422 or your POLYGONVATRO leakage protection device": "Port de votre SYR SaveTech Connect 2422 ou de votre dispositif de protection contre les fuites POLYGONVATRO",
    "SafeFloor Connect 1 - IP address": "SafeFloor Connect 1 - Adresse IP",
    "SafeFloor Connect 1 - Serial number": "SafeFloor Connect 1 - Numéro de série",
    "SafeFloor Connect 2 - IP address": "SafeFloor Connect 2 - Adresse IP",
    "SafeFloor Connect 2 - Serial number": "SafeFloor Connect 2 - Numéro de série",
    "SafeFloor Connect 3 - IP address": "SafeFloor Connect 3 - Adresse IP",
    "SafeFloor Connect 3 - Serial number": "SafeFloor Connect 3 - Numéro de série",
    "SafeFloor Connect 4 - IP address": "SafeFloor Connect 4 - Adresse IP",
    "SafeFloor Connect 4 - Serial number": "SafeFloor Connect 4 - Numéro de série",
    "SafeFloor Units": "Unités SafeFloor",
    "Seconds to retry connection to device": "Secondes pour réessayer la connexion à l'appareil",
    "Serial number of first SYR SaveFloor Connect device": "Numéro de série du premier appareil SYR SaveFloor Connect",
    "Serial number of fourth SYR SaveFloor Connect device": "Numéro de série du quatrième appareil SYR SaveFloor Connect",
    "Serial number of second SYR SaveFloor Connect device": "Numéro de série du deuxième appareil SYR SaveFloor Connect",
    "Serial number of third SYR SaveFloor Connect device": "Numéro de série du troisième appareil SYR SaveFloor Connect",
    "Tasks": "Tâches",
    "Timeout device data request in seconds": "Expiration de la demande de données de l'appareil en secondes",
    "alarm polling time in seconds": "temps d'interrogation de l'alarme en secondes",
    "factor german water hardness": "facteur de dureté de l'eau allemande",
    "fast polling time in seconds": "temps d'interrogation rapide en secondes",
    "more logging messages": "plus de messages de journalisation",
    "more loging messages": "plus de messages de journalisation",
    "regular main valve movement": "mouvement régulier de la vanne principale",
    "show API response as info logging messages": "afficher la réponse de l'api sous forme de messages de journalisation d'informations",
    "show api response as info logging messages": "afficher la réponse api comme info journalging messages",
    "show values as log info messages": "afficher les valeurs sous forme de messages d'informations de journal",
    "slow polling time in seconds": "temps d'interrogation lent en secondes",
    "timing of regular main valve movement": "moment du mouvement régulier de la vanne principale",
    "very slow polling time in seconds": "temps d'interrogation très lent en secondes",
    "wamo adapter settings": "Paramètres d'adaptateur pour wamo"
}
